Revit 2027 API
ImageInstance.HeightScale Property
 The factor applied to the ImageType to calculate the Height of the ImageInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HeightScale { get; set; }
Public Property HeightScale As Double
	Get
	Set
public:
property double HeightScale {
	double get ();
	void set (double value);
}
member HeightScale : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for heightScale results in a height that is more than 30000 feet. -or- When setting this property: The given value for heightScale results in a width that is more than 30000 feet because LockProportions is set to true.
ArgumentOutOfRangeException |  When setting this property: The given value for heightScale must be non-negative.
Remarks
 If LockProportions is true, then changes to the HeightScale will also result in changes to the WidthScale.
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace